using DifferentialEquations
using Plots

# ==========================================
# Лабораторная работа №5
# Модель «Хищник – жертва»
# Вариант 49
# ==========================================

# Коэффициенты модели
a = 0.76
b = 0.082
c = 0.62
d = 0.039

# ==========================================
# Система дифференциальных уравнений
# ==========================================

function predator_prey!(du, u, p, t)
    x, y = u

    du[1] = -a * x + b * x * y
    du[2] =  c * y - d * x * y
end

# ==========================================
# Начальные условия
# x(0) = 8
# y(0) = 20
# ==========================================

x0 = 8.0
y0 = 20.0

u0 = [x0, y0]

# ==========================================
# Интервал моделирования
# ==========================================

tspan = (0.0, 400.0)

# ==========================================
# Численное решение
# ==========================================

prob = ODEProblem(predator_prey!, u0, tspan)

sol = solve(
    prob,
    Tsit5(),
    saveat = 0.1
)

# 1. График численности хищников x(t)

p1 = plot(
    sol.t,
    sol[1, :],
    xlabel = "t",
    ylabel = "x(t)",
    label = "Хищники",
    title = "Изменение численности хищников",
    linewidth = 2
)

# 2. График численности жертв y(t)

p2 = plot(
    sol.t,
    sol[2, :],
    xlabel = "t",
    ylabel = "y(t)",
    label = "Жертвы",
    title = "Изменение численности жертв",
    linewidth = 2
)

# 3. Фазовый портрет


p3 = plot(
    sol[2, :],
    sol[1, :],
    xlabel = "y — жертвы",
    ylabel = "x — хищники",
    label = "Фазовая траектория",
    title = "Фазовый портрет модели «хищник–жертва»",
    linewidth = 2
)

# Сохранение графиков в PNG

savefig(p1, "predators.png")
savefig(p2, "prey.png")
savefig(p3, "phase_portrait.png")

# Вывод графиков на экран

display(p1)
display(p2)
display(p3)

# Стационарные состояния


x_star = c / d
y_star = a / b

println()
println("==========================================")
println("Стационарное состояние")
println("==========================================")

println("x* = ", x_star)
println("y* = ", y_star)

println()
println("Тривиальное стационарное состояние:")
println("(x, y) = (0, 0)")

println()
println("==========================================")
println("Графики сохранены:")
println("predators.png")
println("prey.png")
println("phase_portrait.png")
println("==========================================")